1. a ээс b хүртэлх тооний нийлбэр ол
2. n ээс m тоо хүртэлх сондгой тооны нийлбэр ол
3. n ээс m тоо хүртэлх тэгш тооны нийлбэр ол
4. n ээс m тоо хүртэлх 3т хуваагдах тооны нийлбэр ол
5. n ээс m тоо хүртэлх 5т хуваагдах тооны нийлбэр ол
6. a тоог b зэрэгт дэвшүүл
7. a болон b тооны үржвэр ол
8. n ээс m тоо хүртэлх сондгой тоонуудын тоог ол
9. n ээс m тоо хүртэлх тэгш тоонуудын тоог ол
10. Өгөгдсөн тооны хуваагчдыг ол
11. Өгөгдсөн тооны хуваагчдын тоог ол
12. Өгөгдсөн үгэнд а үсэг хэдэн удаа орсон байна вэ
13. Өгүүлбэрийн үгүүдээс b үсгийг хас
14. Өгөгдсөн тооны цифрүүдийн нийлбэрийг ол
15. Өгөдсөн n тоо анхны тоо мөн үү
16. 3 оронтой бүх палендром тоонуудыг ол 
17. Цифрүүдын нийлбэр нь k байх бүх 3 оронтой тоонуудын тоог ол
18. Өгөгдсөн тоо анхны тоо мөн үү
19. n ээс m тоо хүртэлх анхны тоонуудыг ол
20. n ээс m тоо хүртэлх анхны тоонуудын тоог ол